# 3. 집합(Aggregation)함수

df.sum()
df.mean()
df.max()
df.describe()
- count : 총 갯수
- mean : 평균값
- std : 표준편차
- min : 최소값
- 25% : 1/4 분위수
- 50% : 2/4 분위수
- 75% : 3/4 분위수
- max : 최대값

In [1]:
import pandas as pd

In [5]:
import warnings
warnings.filterwarnings('ignore')

In [2]:
# DataFrame 생성

data = {'country': ["kor", "usa", "china" , 'japan'],
        'rank': [1, 2, 3, 4],
        'grade' : ['A', 'B', 'C', 'D'],
        'score': [100,80,60,40]
        }
df = pd.DataFrame(data)
df

  country  rank grade  score
0     kor     1     A    100
1     usa     2     B     80
2   china     3     C     60
3   japan     4     D     40

In [7]:
print(df.sum())
print(df.mean()) # 문자의 평균은 구할 수 없음
print(df.max()) #  문자의 경우 ascii 코드 값이 큰 값 
print(df.min())

df.describe()

country    korusachinajapan
rank                     10
grade                  ABCD
score                   280
dtype: object
rank      2.5
score    70.0
dtype: float64
country    usa
rank         4
grade        D
score      100
dtype: object
country    china
rank           1
grade          A
score         40
dtype: object

           rank       score
count  4.000000    4.000000
mean   2.500000   70.000000
std    1.290994   25.819889
min    1.000000   40.000000
25%    1.750000   55.000000
50%    2.500000   70.000000
75%    3.250000   85.000000
max    4.000000  100.000000

In [8]:
# 하나의 컬럼에 적용
## score 의 mean 값 구하기!

df.score.mean()
df['score'].mean()
df.loc[:, 'score'].mean()
df.iloc[:, 3].mean()

70.0

In [14]:
# 여러 컬럼에 적용

df[['rank', 'score']].sum(axis=0) # axis = 0, 가로축 중심 -> 각 행을 모두 더한값

rank      10
score    280
dtype: int64
0    101
1     82
2     63
3     44
dtype: int64

           rank       score
count  4.000000    4.000000
mean   2.500000   70.000000
std    1.290994   25.819889
min    1.000000   40.000000
25%    1.750000   55.000000
50%    2.500000   70.000000
75%    3.250000   85.000000
max    4.000000  100.000000

In [ ]:
df[['rank','score']].sum(axis=1)  # axis = 1  세로축 중심 -> 각 열을 모두 더한값
                                    #sum 함수 : int 기준이기때문에 문자는 더하지 X

In [15]:
df.describe()

           rank       score
count  4.000000    4.000000
mean   2.500000   70.000000
std    1.290994   25.819889
min    1.000000   40.000000
25%    1.750000   55.000000
50%    2.500000   70.000000
75%    3.250000   85.000000
max    4.000000  100.000000

# 4. 정렬
- sort_index(), index 순서대로 정렬
- sort_values(by=['컬럼'], ascending=True)
- column의 value값대로 정렬 / 오름차순(True), 내림차순(False)

1) sort_index()

In [17]:
df.sort_index()
df.sort_index(axis =0) # 인덱스 정렬

   score  rank grade country
0    100     1     A     kor
1     80     2     B     usa
2     60     3     C   china
3     40     4     D   japan

In [18]:
df.sort_index(axis =1) # 컬럼순 정렬

  country grade  rank  score
0     kor     A     1    100
1     usa     B     2     80
2   china     C     3     60
3   japan     D     4     40

In [19]:
df.sort_index(axis =1 , ascending=False) # 컬럼을 내림차순으로 정렬

   score  rank grade country
0    100     1     A     kor
1     80     2     B     usa
2     60     3     C   china
3     40     4     D   japan

2) sort_values(by=['컬럼'])

In [ ]:
- 하나의 컬럼값으로 정렬

In [20]:
df.sort_values(by=['score']) # score 칼럼을 기준으로 오름차순 정렬

  country  rank grade  score
3   japan     4     D     40
2   china     3     C     60
1     usa     2     B     80
0     kor     1     A    100

In [21]:
df.sort_values(by=['score'], ascending = False) # score 칼럼을 기준으로 내림차순 정렬

  country  rank grade  score
0     kor     1     A    100
1     usa     2     B     80
2   china     3     C     60
3   japan     4     D     40

In [ ]:
- 2개 이상의 컬럼값으로 정렬
    - 첫번째 기준으로 정렬 후 -> 두번쨰 기준으로 정렬

In [25]:
df.sort_values(by=['country', 'score'])

  country  rank grade  score
2   china     3     C     60
3   japan     4     D     40
0     kor     1     A    100
1     usa     2     B     80

In [26]:
df.sort_values(by=['country', 'score'], ascending=[True, False])

  country  rank grade  score
2   china     3     C     60
3   japan     4     D     40
0     kor     1     A    100
1     usa     2     B     80

# 5. NaN 데이터 처리하기
- NaN : Not a Number, null 데이터
- isnull() or isna()(is not a number) : 값이 null이면 True(null 체크 함수)
- fillna() : null 데이터를 찾아 value로 지정된 값으로 변환
- dropna() : 행 데이터를 기준으로 null 값이 포함된 데이터 제거

1.NaN 데이터는 분석 결과에 치명적인 영향을 줄 수 있음 \
2.우선, NaN데이터가 포함되어 있는지 여부를 체크  
3.NaN 데이터를 어떻게 핸들링 할 것인지 결정 (값을 채울 것인지, 없앨 것인지)

In [28]:
import numpy as np

(1) NaN : Not a Number, null 데이터

In [30]:
df['check'] = np.nan
df

  country  rank grade  score  check
0     kor     1     A    100    NaN
1     usa     2     B     80    NaN
2   china     3     C     60    NaN
3   japan     4     D     40    NaN

In [32]:
df.isna() #df.isnull()

   country   rank  grade  score  check
0    False  False  False  False   True
1    False  False  False  False   True
2    False  False  False  False   True
3    False  False  False  False   True

(2) fillna()
- NaN을 '채울값'으로 채우기

In [35]:
# NaN을 True로 채우기
df.fillna(value = "채워주세요")

  country  rank grade  score  check
0     kor     1     A    100  채워주세요
1     usa     2     B     80  채워주세요
2   china     3     C     60  채워주세요
3   japan     4     D     40  채워주세요

(3) dropna()
- df.dropna(how='any'): NaN이 포함된 행은 모두 제거
- df.dropna(how='all'): 행 전체가 NaN인 것 제거

# 6.데이터 타입 변환
- astype()
- to_numeric()
- to_datetime()
- to_timedelta()

In [37]:
# DataFrame 생성

data = {'country': ["kor", "usa", "china", "japan"],
        'rank': [1, 2, 3, 4],
        'score': [100.0, 80.0, 60.0, 40.0],
        'birth': ["1.1.2022", "2.1.2023", "3.1.2024", "4.1.2025"],
        'etc': ["1", "2", "3", "4"]        
        }
column = ['country', 'rank', 'grade', 'score', 'birth', 'etc']
df = pd.DataFrame(data, columns=column)
df

  country  rank grade  score     birth etc
0     kor     1   NaN  100.0  1.1.2022   1
1     usa     2   NaN   80.0  2.1.2023   2
2   china     3   NaN   60.0  3.1.2024   3
3   japan     4   NaN   40.0  4.1.2025   4

(1) astype()

In [38]:
df.dtypes

# rank 컬럼의 데이터 타입을 정수->실수형으로 변경
df['rank'].dtypes
df['rank'].astype('float')

# score 컬럼의 데이터 타입을 실수->정수형으로 변경
df['score'].dtypes
df['score'].astype('int')

0    100
1     80
2     60
3     40
Name: score, dtype: int32

(2) to_numeric() : 문자열 형태를 적절한 타입 데이터로 변환해줌

In [39]:
df['etc'].dtypes # dtype('O') => Object 즉, 문자열

dtype('O')

In [40]:
pd.to_numeric(df['etc'])

0    1
1    2
2    3
3    4
Name: etc, dtype: int64

(3) to_datetime()

In [41]:
df['birth'].dtypes

dtype('O')

In [42]:
pd.to_datetime(df['birth'])

## 여기서 년, 월, 일 있는 경우 변환 X
## replace 함수로 '2022년 3월 3일, 2022년 3월 30일' 에서 '2022-3-3 혹은  2022.3.30' 로 변경하는게 좋음

0   2022-01-01
1   2023-02-01
2   2024-03-01
3   2025-04-01
Name: birth, dtype: datetime64[ns]

## GroupBy 함수

In [ ]:
df = pd.read_csv('nba.csv')
df

In [ ]:
# 팀별로 그룹 생성
groupby_team = df.groupby('Team')
type(groupby_team)

In [ ]:
groupby_team.groups # 뒤에 나오는 숫자는? -> index번호

In [ ]:
list(groupby_team) # 그룹별로 데이터를 보여줌.

In [ ]:
for Name, Team in groupby_team:
    print(Name + " : " + str(len(Team)))
    print(Team)
    print("==="*10)

In [ ]:
# 포지션별로 그룹 생성
groupby_position = df.groupby('Position')
type(groupby_position)

In [ ]:
for Name, Position in groupby_position:
    print(Name + " : " + str(len(Position)))
    print(Position)
    print("==="*10)

In [ ]:
new_df_position = pd.DataFrame({'count' : groupby_position.size()}).reset_index()
new_df_position

In [ ]:
new_df_team = pd.DataFrame({'count' : groupby_team.size()}).reset_index()
new_df_team

# 7. 데이터프레임 교차
- Transpose

In [ ]:
data = {'country': ["kor", "usa", "china", "japan"],
        'rank': [1, 2, 3, 4],
        'grade': ["A", "B", "C", "D"]
        }
column = ['country', 'rank', 'grade']
df = pd.DataFrame(data, columns=column)
df

In [ ]:
df = df.T
df
df.dtypes
df.index
df.values

# 8.데이터 프레임 합치기
- pd.concat()
- append()
- merge()

In [ ]:
# DataFrame 생성
data1 = {'country': ["kor", "usa"],
        'rank': [1, 2]
        }

data2 = {'country': ["china", "japan"],
        'rank': [3, 4]
        }
columns = ['country', 'rank']

df1 = pd.DataFrame(data1, columns=columns)
df2 = pd.DataFrame(data2, columns=columns)

In [ ]:
(1) pd.concat()

In [ ]:
# 행 기준으로 합치기
result = pd.concat([df1, df2])
# result = pd.concat([df1, df2], ignore_index=True)

In [ ]:
# 열 기준으로 합치기 (기존 데이터프레임에 열이 추가됨)
result = pd.concat([df1, df2], axis=1, ignore_index=True)
result

(2) append()
- 첫 번째 데이터 프레임의 새로운 행으로 추가

In [ ]:
result = df1.append(df2, ignore_index=True)
result

(3) merge()
- 열을 기반 데이터프레임 JOIN 시 사용
- how 옵션: inner, left, right, outer

In [ ]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['김남준', '민윤기', '김석진', '정호석', '박지민', '김태형', '전정국']
}, columns=['고객번호', '이름'])
df1

In [ ]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

In [ ]:
# inner join, 열을 기준으로 데이터프레임에 모두 키가 존재하는 데이터만 보여준다.
pd.merge(df1, df2)
# pd.merge(df1, df2, how='inner')

In [ ]:
# 공통되는 값이 없어도, 즉 키가 한쪽에만 있어도 데이터를 보여준다.
pd.merge(df1, df2, how='outer')

In [ ]:
# 왼쪽 데이터 프레임을 기준으로 합친다. 오른쪽 df2에는 1002 고객 데이터가 없었기 때문에 금액이 NaN이 뜬다.
pd.merge(df1, df2, how='left')

In [ ]:
# 오른쪽 데이터 프레임을 기준으로 합친다. 왼쪽 df1에는 1003 고객 데이터가 없기 때문에 아예 뜨지가 않는다.
pd.merge(df1, df2, how='right')

# 9.데이터 입출력
- csv, excel, html 등의 데이터 로드 및 저장 가능

In [ ]:
# DataFrame 생성
data = {'country': ["kor", "usa", "china", "japan"],
        'rank': [1, 2, 3, 4],
        'grade': ["A", "B", "C", "D"]
        }
column = ['country', 'rank', 'grade']
df = pd.DataFrame(data, columns=column)
df

In [ ]:
(1) to_csv() : df를 csv 파일로 저장

In [ ]:
# df.to_csv('../data/example.csv')
# df.to_csv('../data/example2.csv', header=False, index=False)
df.to_csv('../data/example3.csv', header=['header1', 'header2','header3'], index=False)

In [ ]:
(2) read_csv() : csv 파일 데이터 불러오기

In [ ]:
data = pd.read_csv('../data/example.csv')
data = pd.read_csv('../data/example2.csv')
data

# 10.엑셀 파일 다루기
- pip install xlrd
- pip install openpyxl

In [ ]:
! pip install xlrd

In [ ]:
! pip install openpyxl

(1) excel 파일 저장

In [ ]:
data = pd.read_csv("../data/example.csv")
data.to_excel("../data/example.xlsx", 'Number1', index=False)

(2) excel 파일 읽기

In [ ]:
data = pd.read_excel('../data/example.xlsx', 'Number1')
data

(3) html의 table 데이터 불러오기

In [ ]:
! pip install lxml

In [ ]:
data = pd.read_html("https://search.naver.com/search.naver?ie=UTF-8&query=%ED%99%98%EC%9C%A8&sm=chr_hty")
data

In [ ]:
len(data) # 테이블 개수 확인

# 11. 기술통계
- Numpy를 활용한 기술통계

In [ ]:
import numpy as np

In [ ]:
x = np.array([-123,-41,-14,-11,-18,-85,105,10,103,8])

In [ ]:
x.shape

In [ ]:
len(x)

In [ ]:
np.mean(x)
# np.sum(x) / len(x)

In [ ]:
np.sum(x)

In [ ]:
np.var(x) # 분산 (variance)

In [ ]:
np.std(x) # 표준편차 (Standard deviation)
# np.sqrt(np.var(x)) # 분산값에 루트를 씌우면 -> 표준편차

In [ ]:
np.max(x)
np.min(x)

In [ ]:
np.median(x)

In [ ]:
np.percentile(x, 25) # 1/4 분위수
np.percentile(x, 50) # 2/4 분위수
np.percentile(x, 75) # 3/4 분위수
np.percentile(x, 100) # 4/4 분위수

In [ ]:
np.quantile(x, 0.5) # 중앙값 = 2/4 분위수

# 12. DataFraem 기술통계

In [ ]:
import pandas as pd

# DataFrame 생성
data = {'country': ["kor", "usa", "china"],
        'rank': [1, 2, 3],
        'GDP': [100,300,200],
        'popular': [4000,12000,30000]
        }
df = pd.DataFrame(data)
df

In [ ]:
df['GDP'].sum()
df['popular'].sum()
df.sum()

In [ ]:
df['GDP'].mean()
df['popular'].mean()

In [ ]:
df.describe()

In [ ]:
df.info()